{
  "NAV_HOME":"HOME",
  "NAV_ABOUT":"About",
  "NAV_SPECIALTY":"Feature",
  "NAV_TTC":"TTC",
  "NAV_WHITE_PAGER":"Whitepaper",
  "NAV_BLOCK_BROWSER":"Explorer",
  "NAV_CONTACT":"Contact",
  "ABOUT_TOP_BUTTON_TITLE":"About TITAN",
  "ABOUT_CONTENT":"With the spirit of the sea, TITAN strives to act as leader of the global economy 5.0. TITAN is the pioneer of industrial blockchain, building ecological empire on a borderless blockchain system as well as opening a new era of global digital trade. Break the uneven distribution of wealth and subvert the solidified model of traditional economy. ",
  "ABOUT_BOTTOM_BUTTON_TITLE":"TITAN Milestone",
  "SPECIALTY_TOP_BUTTON_TITLE":"Feature",
  "CARD_1_TITLE":"New era entertaiment",
  "CARD_2_TITLE":"All-around livestream",
  "CARD_3_TITLE":"Inclusive financial",
  "CARD_4_TITLE":"Mining Mall",
  "CARD_1_CONTENT": "Creation is \"mining\" for content generators, and participation in ecosystem is 'mining' for audience.\n",
  "CARD_2_CONTENT": "The advantages of blockchain enables the natural transforming of the current live broadcast industry.\n",
  "CARD_3_CONTENT": "TITAN integrates blockchain technology into the full financial business scenarios and embraces the future and changes.\n",
  "CARD_4_CONTENT": "Introduce precise traffic into the real economy. Cultivate and expand consumer consensus with TTC as value carrier in the system.\n",
  "BORDER_1_TITLE": "TITAN hybrid consensus mechanism\n",
  "BORDER_2_TITLE": "TITAN Cross-chain/side-chain\n",
  "BORDER_3_TITLE": "TITAN Sharding\n",
  "BORDER_4_TITLE": "TITAN Encryption\n",
  "BORDER_1_CONTENT": "TITAN PoST hyperspace-time proof mechanism + PoS, do not need to consume much electricity for operation.\n",
  "BORDER_2_CONTENT": "Participants-friendly for all actions on the TITAN main chain. At the same time, users can access a large number of new services, so that the five major ecosystems can operate smoothly.\n",
  "BORDER_3_CONTENT": "TITAN has made major improvements over the ethereum sharding technology, the main difference being that the blocks on the TITAN chains are stacked vertically and therefore can run different applications.\n",
  "BORDER_4_CONTENT": "The originally created TISS solution, has high security and can be quickly installed and signed. It is easy to retrieve under special circumstances and plays an important role in the confidential documents of many companies.\n",
  "SPECIALTY_BOTTOM_BUTTON_TITLE":"TITAN  Tech Structure",
  "TTC_TOP_BUTTON_TITLE":"the value carrier in TITAN ecology",
  "EQUATION_TITLE": "Halving：",
  "EQUATION_CONTENT": "Y(total supply)=X（day）*",
  "TTC_BOTTOM_BUTTON_TITLE":"TTC Destruction mechanisms",
  "TTC_TEXT_LEFT":"TITAN ecological token TTC will be in the state of \"deflation\" for a long time, and the TTC in circulation will be destroyed by different mechanisms, thus ensuring an unlimited prosperity of TITAN ecology. \nThe TTC Token will adopt the following destruction mechanisms:\n",
  "TTC_TEXT_RIGHT": "1. Tokens that can not be fully distributed will be destroyed when the total mining power of the day is not fully shared by the entire network;\n2. 80% of the transaction fees will be destroyed on a regular basis;\n3. TITAN the Singapore Foundation will regularly buy-back TTC from the secondary market;\n4. The transfer fee on the TITAN main chain is 0.01 TTC, and it will be 100% destroyed.\n",
  "BOTTOM_ABOUT":"About TITAN",
  "BOTTOM_MILESTONE":"Destruction mechanisms",
  "BOTTOM_SPECIALTY":"Feature",
  "BOTTOM_FRAMEWORK":"TITAN  Tech Structure",
  "BOTTOM_ZOOLOGY":"the value carrier in TITAN ecology",
  "BOTTOM_DESTROY":"Destruction mechanisms",
  "BOTTOM_MORE":"more",
  "BOTTOM_WHITE_PAPER":"Whitepaper",
  "BOTTOM_BLOCK_BROWSER":"Explorer",
  "BOTTOM_JOIN_US":"Contact",
  "BOTTOM_TWITTER":"Twitter:\ntitanchainttc\n@gmail.com",
  "BOTTOM_TELEGRAM":"Telegram:\nTitanchain",
  "BOTTOM_EMAIL":"Email:\ntitanttc@163.com",
  "STEP1":"In September 2018, the Singapore Foundation launched TITAN chain.",
  "STEP2":"In November 2018, market research for the world to determine the development direction of the platform.",
  "STEP3":"In February 2019, recruit talents and finalize the core team to complete the overall design.",
  "STEP4":"In December 2019, first internal measurement of the main chain.",
  "STEP5":"In March 2020, main chain internal test success.",
  "STEP6":"In August 2020, launch main chain and the exchange.",
  "STEP7":"In early 2021, the opening of the mall ecology as well as the entertainment sector.",
  "STEP8":"In early 2022, complete TITAN ecological foundation construction closed ecological loop.",
  "STEP9":"In 2023, main chain consensus upgrade, brand upgrade, move forward in the global scope.",
  "STEP10":"In 2024, the cross-chain interactive technology was opened to complete the global investment trading ecology. "
}
